using NBitcoin;
using System;
using System.Collections.Generic;
using System.Text;

namespace Thaismartcontract.API
{
    internal partial class ThaiWordList
    {
        private static Wordlist _Thai;
        public static Wordlist Thai
        {
            get
            {
                if (_Thai == null)
                {
                    PopulateWordList();
                }
                return _Thai;
            }
            
        }

       private static void PopulateWordList()
        {
            var words =
                "ก๊ก,ก้น,กบฏ,ก้ม,กรง,กรด,กรม,กระ,กลบ,กลม,กวน,กวี,ก่อ,กอง,กอด,กอน,กอส,กัก,กัง,กัด,กัน," +
                "กับ,ก้า,กาก,กาง,กาม,กาย,การ,กาล,กิจ,กิน,กี่,กุม,กุล,กู้,เก๋,เกม,เกษ,เกะ,เกา,แก่,แก้,แกง,แกน," +
                "แกม,แกะ,โก้,โกง,ไก่,ไกล,ขณะ,ขนม,ข่ม,ขยะ,ขวด,ขวบ,ขวา,ข้อ,ของ,ขอน,ขอบ,ขัง,ขัด,ขัน,ขับ," +
                "ข้า,ขาด,ขาน,ขาย,ขาว,ขี่,ขี้,ขีด,ขืน,ขุด,ขุน,ขู่,เขต,เขา,แขก,แขน,โขง,โขน,ไข่,ไข้,คณะ,คดี,คติ," +
                "ค้น,ครก,ครบ,ครู,ควง,ควบ,ควร,คอย,ค่ะ,คัน,คับ,ค่า,ค้า,คาง,คาด,คาน,คาบ,ค่ำ,คิด,คิว,คืน,คืบ,คือ" +
                ",คุก,คุณ,คุม,คุย,คู่,คูณ,เคย,แค่,แคน,แคบ,โคม,ใคร,ฆ่า,งวด,งอน,งาน,งาม,เงย,เงา,แง่,โง่,จอง,จอด" +
                ",จอม,จอย,จัด,จัน,จับ,จ่า,จาก,จาง,จาน,จิก,จิต,จิบ,จี้,จีน,จีบ,จึง,จุก,จุด,จุน,จู่,จูง,จูบ,เจอ,แจก,โจร," +
                "ฉวย,ฉัน,ฉาก,ฉาย,ฉีก,ฉีด,ฉุด,เฉย,โฉม,ชวน,ช่อ,ชอบ,ชัก,ชัด,ชัน,ชัย,ช้า,ชาญ,ชาน,ชาม,ชาย,ชาว," +
                "ช้ำ,ชิง,ชิด,ชิน,ชิม,ชี้,ชีพ,ชุด,ชุน,เชง,แช่,โชค,ใช่,ใช้,ซวย,ซอก,ซอง,ซอย,ซัก,ซัด,ซับ,ซ่า,ซาก,ซ้ำ,ซี่," +
                "ซีก,ซีด,ซึม,ซุป,แซม,แซว,โซ่,โซน,ฐาน,ดวง,ดอก,ดอง,ดอน,ดอย,ดัก,ดัง,ดัน,ดับ,ด่า,ดาบ,ดาว,ดิน,ดิบ," +
                "ดีด,ดึก,ดึง,ดุจ,ดูด,เดช,เดน,เดา,แดง,แดด,แดน,โดด,โดน,โดย,ได้,ต้น,ต้ม,ตรง,ตรา,ตรี,ตลก,ต่อ,ตอง," +
                "ตอน,ตอบ,ตัก,ตัด,ตัน,ตับ,ตัว,ตาก,ตาม,ตาย,ต่ำ,ติก,ติด,ติว,ตีน,ตีบ,ตึก,ตึง,ตุง,ตู้,เตะ,เตา,แต่,แตก,แตง," +
                "แตะ,โต้,ใต้,ไต่,ไตร,ถอด,ถอน,ถอย,ถัก,ถัง,ถัด,ถ้า,ถาด,ถาม,ถ้ำ,ถีบ,ถึง,ถือ,ถุง,ถูก,แถบ,แถม,แถว,โถง," +
                "ทรง,ทวน,ท่อ,ทอง,ทอด,ทอน,ทัก,ทัน,ทับ,ทัพ,ท่า,ทาง,ทาน,ทาย,ทาส,ทิพ,ทิศ,ที่,ทีม,ทึบ,ทุก,ทุน,ทุบ,ทูต," +
                "ทูล,เท่,เทค,เทป,เทพ,เทศ,เทา,แท้,แทง,แทน,แทบ,โทน,โทร,โทษ,ไทย,ธนู,ธูป,เธอ,นคร,นรก,นวด,นวล," +
                "นอก,นอน,นัก,นัง,นัด,นัน,นับ,น่า,น้า,นาก,นาง,นาถ,นาน,นาม,นาย,น้ำ,นิก,นิด,นิล,นิว,นี่,นี้,นึก,นึง,นุช," +
                "เนย,แน่,แนบ,แนว,แนะ,บ่น,บวก,บวช,บวม,บ่อ,บอก,บอย,บอล,บัง,บัน,บัว,บ่า,บ้า,บาง,บาท,บาน,บาป,บาย," +
                "บิด,บิน,บี้,บีบ,บีม,บึง,บุก,บุญ,เบน,เบา,แบก,แบน,แบบ,โบก,ปฐม,ประ,ปลด,ปลา,ปวด,ปอด,ปัก,ปัง,ปัด,ปัน," +
                "ป่า,ป้า,ป๋า,ปาก,ปาง,ปาน,ปิด,ปี้,ปีก,ปีน,ปืน,ปู่,ปูน,เป้,เปน,แปด,แปล,แปะ,โปร,ผลิ,ผอม,ผัก,ผัด,ผัน,ผับ,ผัว," +
                "ผ่า,ผ้า,ผิด,ผิว,ผืน,ผุด,ผู้,ผูก,เผย,เผา,แผ่,แผง,แผน,แผล,ไผ่,ฝัก,ฝัง,ฝัน,ฝ่า,ฝ้า,ฝาก,ฝึก,ฝืน,ฝูง,แฝง,พ่น,พ้น," +
                "พนม,พรม,พระ,พวก,พวง,พ่อ,พอง,พัก,พัง,พัด,พัน,พับ,พาด,พาน,พาย,พิง,พิม,พิษ,พี่,พึง,พืช,พุธ,พูด,เพศ,แพ้," +
                "แพง,แพน,แพร,ฟรี,ฟอง,ฟัง,ฟัน,ฟ้า,ฟาก,ฟาง,ฟาด,ฟุต,แฟน,ภัย,ภาค,ภาพ,มณี,มติ,มโน,มวย,มวล,มหา,มอง," +
                "มอญ,มอบ,มัก,มัง,มัด,มัน,มัว,ม่า,ม้า,มาก,มาน,มาร,มิด,มิน,มีด,มึง,มืด,มือ,มุก,มุข,มุม,มูล,เมฆ,เมน,เมา,แม่,แม้," +
                "แมน,แมว,โมง,ไม่,ไม้,ย่น,ย่อ,ยอด,ยอน,ยอม,ยัก,ยัง,ยัด,ยัน,ย่า,ยาก,ยาง,ยาน,ยาม,ยาย,ยาว,ย้ำ,ยิง,ยิน,ยิว,ยีน," +
                "ยึด,ยืด,ยืน,ยืม,ยุค,ยุง,ยุบ,แย่,แยก,โยง,โยน,ร่ม,รวบ,รวม,รวย,รอง,รอด,รอน,รอบ,รอย,รัก,รัง,รัฐ,รัด,รัน,รับ," +
                "ราก,ราง,ราช,ราด,ราบ,ราม,ราย,ราว,ริก,ริน,ริม,รี่,รีด,รีบ,รุก,รุม,รู้,รูป,เรน,เรส,เรา,แร่,แรก,แรง,แรม,โร่,โรค," +
                "โรง,โรม,โรย,ไร่,ไร้,ฤดู,ล้น,ล้ม,ลวง,ล่อ,ล้อ,ลอก,ลอง,ลอด,ลอบ,ลอย,ล่ะ,ลัก,ลัด,ลัน,ลับ,ลัย,ล่า,ลาก,ลาง,ลาด,ลาน," +
                "ลาภ,ลาย,ลาว,ล้ำ,ลิง,ลิน,ลี่,ลี้,ลีก,ลึก,ลืม,ลือ,ลุก,ลุง,ลุย,ลู่,ลูก,ลูบ,เลข,เลน,เลย,เลว,เลอ,แลก,และ,โลก,โลภ," +
                "ไล่,วรา,วอน,วัง,วัด,วัน,วับ,วัย,วัว,ว่า,วาง,วาด,วาน,วาบ,วาย,วิน,วิว,วี่,วูบ,เวน,เวร,แวบ,แวว,แวะ,ไว้,ศรี," +
                "ศาล,ศีล,ศึก,เศษ,โศก,ส่ง,สงบ,สติ,สปา,สภา,ส้ม,สระ,สรา,สละ,สวด,สวน,สวม,สวย,สอง,สอด,สอน,สอบ,สัก," +
                "สัง,สัญ,สัน,สับ,สัม,สาด,สาน,สาป,สาม,สาย,สาร,สาว,สิง,สิน,สิบ,สิว,สี่,สืบ,สุก,สุข,สุด,สุร,สู่,สู้,สูง,สูญ,สูด," +
                "สูท,สูบ,เสน,เสพ,เสา,แสง,แสน,แสบ,โสด,ใส่,ไส้,หนอ,หนา,หนี,หนู,ห่ม,หมด,หมอ,หมา,หมี,หมู,หยด,หรู," +
                "หลง,หลบ,หลี,หวง,หวน,หวย,ห่อ,หอบ,หอม,หอย,หัก,หัด,หัน,หัว,ห้า,หาก,หาง,หาด,หาย,หาร,หิน,หิว,หีบ," +
                "หึง,หุง,แห่,แหง,แหม,โหด,โหย,โหล,ให้,ไหน,ไหม,ไหล,ไหว,อ้น,อวด,อวน,อ้อ,อ๋อ,ออก,ออม,อัง,อัด,อัน," +
                "อ้า,อาจ,อาบ,อาย,อิง,อิฐ,อิน,อิม,อีก,อึน,อืม,อือ,อุด,อุป,อู่,เอก,เอง,เอน,เอย,เอว,เออ,เอา,แอง,แอน,แอบ" +
                ",แอม,โอ้,โอน,โอบ,ไอ้,ฮวง,ฮัน,ฮ่า,ฮิต,ฮือ,เฮา,วาทะ,กรณี,กรรณ,กรรม,กรอก,กรอง,กรอบ,กรัม,กราบ,กริช," +
                "กรีก,กรีด,กรุง,กลไก,กลอง,กลอน,กลับ,กลัว,กล้า,กลาง,กลาย,กลีบ,กลืน,กว่า,กวาง,กวาด,ก้อง,ก็อด,ก่อน,ก้อน," +
                "กั้น,ก๊าซ,ก้าน,กาแฟ,ก้าว,กำไร,กิ่ง,กิโล,กีฬา,กึ่ง,กุ้ง,กุศล,เก่ง,เก็ต,เก็บ,เกรง,เกรด,เกษม,เก่า,เก้า,เกาะ,เกิด," +
                "เกิน,แก๊ง,แก่น,แก้ม,แก้ว,แก๊ส,โกรธ,โกหก,ใกล้,ขจัด,ขนาด,ขนาน,ขบวน,ขมวด,ขโมย,ขยัน,ขยับ,ขยาย,ขวัญ," +
                "ขวับ,ขวาง,ขั้น,ขั้ว,ข้าง,ข้าม,ข่าย,ข่าว,ข้าว,ขึ้น,ขุ่น,เข็น,เข็ม,เข้ม,เขมร,เข่า,เข้า,เขิน,แข็ง,แข่ง,แขนง,แขวน," +
                "คนจน,คนใน,ครอง,ครอบ,ครับ,ครัว,คราบ,คราว,คริส,ครีม,ครู่,คลอง,คลอด,คลัง,คลาน,คลาย,คล้ำ,คลุม,ควัน," +
                "คว้า,ความ,ควาย,คว่ำ,ค่อน,ค้อน,ค่อย,คอร์,ค้าง,คาถา,ค่าย,คำขอ,คิ้ว,คีรี,คุ้น,คุ้ม,คุรุ,เค้ก,เค็ม,เคมี,เค้า,เคาะ," +
                "แค้น,แคร์,โค้ง,โคจร,โค่น,โครง,โคลง,โคลน,ใคร่,โฆษก,ง่วง,งั้น,ง่าย,เงิน,จงใจ,จดจำ,จมูก,จริง,จ้อง,จักร,จ้าง," +
                "จ่าย,จำนำ,จิตร,จิ้ม,จิ๋ว,จุฬา,เจ็ด,เจ็บ,เจ้า,เจาะ,แจ้ง,ใจดี,ฉบับ,ฉลอง,ฉลาก,ฉลาด,ฉัตร,ชนบท,ชนิด,ชมพู,ชมรม," +
                "ช่วง,ช่วย,ช่อง,ช้อน,ชะตา,ชะลอ,ชั่ง,ชั้น,ชั่ว,ช่าง,ช้าง,ชาดก,ชาติ,ชานุ,ชายา,ชำระ,ชิ้น,ชีวะ,ชื่น,ชื้น,ชื่อ,ชุ่ม,เช็ค," +
                "เช็ด,เช่น,เช่า,เช้า,เชิง,เชิญ,เชิด,โชติ,โชว์,ซ่อน,ซ้อน,ซ่อม,ซ้อม,ซ้าย,ซิ่น,ซึ่ง,ซึ้ง,ซื่อ,ซื้อ,ซุ้ม,เซ็ง,เซ็น,เซีย,โซฟา," +
                "ไซต์,ญาติ,ฎีกา,ฐานะ,เฒ่า,ด้วง,ด่วน,ด้วย,ด้อย,ดั่ง,ด่าน,ด้าน,ดารา,ดำรง,ดิ่ง,ดิ้น,ดีใจ,ดื่ม,ดื้อ,ดูแล,เด็ก,เด็ด,เด่น," +
                "เดอะ,เดิน,เดิม,ตกใจ,ตกลง,ตรวจ,ตรัส,ตรึง,ตลอด,ตลาด,ต้อง,ต่อม,ต่อย,ตั้ง,ตั๋ว,ต่าง,ต้าน,ตำบล,ตำรา,ตื่น,ตื้น,ตุ่ม," +
                "เต้น,เต็ม,เต่า,เต๋า,เติม,แต่ง,แต้ม,โต๊ะ,ถนอม,ถนัด,ถล่ม,ถ้วน,ถ้วย,ถวาย,ถั่ว,ถ่าย,ถาวร,ถิ่น,เถิด,แถลง,ทบวง,ทยอย," +
                "ทราบ,ทราย,ทรุด,ท่วม,ทว่า,ทวีป,ทหาร,ท่อง,ท้อง,ท่อน,ทะลุ,ทะเล,ทั้ง,ทั่ว,ท่าน,ท้าย,ทารก,ท้าว,ทำตา,ทำนา,ทำไม,ทิ้ง," +
                "ทีละ,ทีวี,ทึ่ง,ทุ่ง,ทุ่ม,เท็จ,เทอม,เท่า,เท้า,แท่ง,แท่น,แทรก,ธรรม,ธาตุ,ธิดา,ธุระ,น้อง,น้อย,นั่ง,นั่น,นั้น,นาที,น่าน," +
                "นานา,นายก,นารี,นิคม,นิ่ง,นิติ,นิยม,นิ้ว,นึ่ง,นุ่ง,นุ่ม,เน็ต,เนตร,เน้น,เน่า,เนิน,แน่น,แน่ะ,โน้ต,โน่น,โน้น,โน้ม," +
                "บ่อย,บัตร,บ้าง,บาตร,บ้าน,บ่าย,บาร์,บาลี,บิ๊ก,บิดา,บุตร,บุรี,บูชา,เบ็ด,เบาะ,เบิก,แบ่ง,ปกติ,ปณิศ,ปทุม,ปรับ,ปราบ," +
                "ปรุง,ปล้น,ปลอด,ปลอบ,ปลอม,ปลัด,ปลาย,ปลิว,ปลุก,ปลูก,ป่วย,ป้อง,ป้อน,ป้อม,ปะทะ,ปะปน,ปั่น,ปั้น,ป้าย,ปิ้ง,ปิ่น," +
                "ปุ่ม,ปุ๋ย,เป็ด,เป็น,เป้น,เปรม,เป่า,เป้า,เปิด,แป้ง,แปรง,แปลก,แปลง,โปรด,ผนวก,ผนัง,ผลัก,ผลัด,ผลิต,ผ่อง,ผ่อน," +
                "ผ่าน,ผึ้ง,เผ็ด,เผลอ,เผ่า,แผ่น,แผนก,แผ่ว,โผล่,ฝั่ง,ฝ่าย,ฝ้าย,ฝุ่น,เฝ้า,พงศ์,พงษ์,พจน์,พนัน,พบปะ,พม่า,พยัก,พยาน," +
                "พยุง,พรรค,พรรณ,พรหม,พราน,พริก,พลอย,พลัง,พลัน,พลาง,พลาด,พลิก,พ้อง,พอใจ,พอดี,พัทธ,พายุ,พารา,พิธี,พึ่ง," +
                "พื้น,พุ่ง,พุทธ,พุ่ม,เพคะ,เพ่ง,เพชร,เพลง,เพาะ,แพร่,ไพร่,ฟ้อง,ฟื้น,ภรณ์,ภัทร,ภาคี,ภาระ,ภาวะ,ภาษา,ภาษี,ภูมิ," +
                "มงคล,มณฑล,มนต์,มรดก,ม่วง,ม้วน,มั่ง,มั้ง,มั่น,มั้ย,มาตร,ม่าน,มานะ,มายา,มะลิ,มาลา,มิตร,มิติ,มื้อ,มุ่ง,เม็ด,เมตร," +
                "เมนู,เมีย,แม่น,แม้น,แมลง,โมฆะ,โมโห,ยนต์,ย้อน,ย่อม,ย้อม,ย่อย,ยะลา,ยั่ว,ย่าง,ย่าน,ย้าย,ยิ่ง,ยิ้ม,ยื่น,ยุ่ง,ยุติ,ยุทธ," +
                "ยุ้ย,เย็น,เย็บ,เย้ย,เยอะ,เยาะ,แย่ง,แย้ง,แย้ม,รถไฟ,ร่วง,ร่วม,รหัส,ร่อง,ร้อง,ร้อน,ร้อย,ระดม,ระบบ,ระบำ,ระบุ,ระยะ," +
                "รั้ง,รั่ว,รั้ว,ราคา,ร่าง,ร้าง,ราชา,ร้าน,ร้าย,ราศี,รื้อ,รุ่ง,รุ้ง,รุ่น,เร่ง,เร็ว,เร้า,เริง,เรือ,ล่วง,ล้วน,ล็อค,ล่อง,ล้อม,ละก็," +
                "ละคร,ลั่น,ล่าง,ล้าง,ล้าน,ลำคอ,ลิตร,ลิ้น,ลิ้ม,ลีลา,ลีโอ,ลื่น,ลื้อ,ลุ้น,ลุ่ม,เล็ก,เลขา,เล็ง,เล่น,เล็บ,เล่ม,เลย์,เล่า,เลิก,เลิศ," +
                "เลีย,แล้ง,แล่น,แล้ว,โล่ง,โลหะ,วงจร,วงศ์,วงษ์,วรรค,ว่าง,วาจา,ว่าย,วาระ,วิ่ง,วิชา,วิตก,วิถี,วิธี,วิมล,วุฒิ,เวที,เว้น," +
                "เว็บ,เวลา,แว่น,แว่ว,โว้ย,ไวน์,ศาลา,ศิริ,ศิลา,สกัด,สกุล,สงฆ์,สงวน,สง่า,สดใส,สตรี,สถาน,สนใจ,สนอง,สนาม,สนิท," +
                "สนุก,สบาย,สบู่,สเปน,สภาพ,สมทบ,สมรส,สมอง,สมัย,สมุด,สยาม,สรรพ,สรุป,สลัก,สลัด,สลับ,สลาย,ส่วน,ส้วม,สวัส," +
                "สวิส,สหาย,ส่อง,ส้อม,สะกด,สะสม,สั่ง,สั่น,สั้น,สากล,สาขา,สามี,ส่าย,สาระ,สิ่ง,สิ้น,สินะ,สิริ,สื่อ,สุรา,สูตร,เส้น,เสนอ," +
                "เสมอ,เสรี,เสวย,เสีย,เสือ,แสดง,หงส์,หงาย,หญ้า,หญิง,หนวด,หนอง,หนอน,หนัก,หนัง,หน้า,หนาว,หนี้,หนุน,หมวก," +
                "หมวด,หมวย,หม้อ,หมอก,หมอน,หมัก,หมัด,หมาก,หมาย,หมึก,หมุน,หมู่,หยวน,หยอด,หย่า,หยาง,หยาบ,หยิบ,หยุด," +
                "หรอก,หรือ,หล่น,หลวง,หล่อ,หลอก,หลอด,หลัก,หลัง,หลับ,หล้า,หลาก,หลาน,หลาย,หลีก,หลุด,หลุม,ห่วง,ห้วง,ห้วย," +
                "หวัง,หวัด,หว่า,หวาน,ห้อง,ห้อย,หั่น,ห่าง,ห้าง,ห้าม,หิมะ,หิ้ว,หุ่น,หุ้น,หุ้ม,เหงา,เหตุ,เห็น,เหมา,เหรอ,แห่ง,แห้ง," +
                "แหลม,แหละ,แหวน,ใหญ่,ใหม่,ไหม้,ไหล่,ไหว้,อคติ,องค์,องศา,อดทน,อดีต,อบรม,อพยพ,อภัย,อมตะ,อย่า,อยาก," +
                "อยู่,อริส,อรุณ,อ้วน,อ่อน,อ้อม,อ้อย,อะไร,อากร,อ่าง,อ้าง,อาญา,อาทร,อาทิ,อ่าน,อ้าย,อายุ,อาร์,อ่าว,อ้าว,อาสา,อิ่ม," +
                "อึ้ง,อื่น,อุดม,อุ่น,อุบล,อุ้ม,เอ็ด,เอ็น,เอ่ย,เอ๋ย,เอ่อ,เอ้อ,เอ๊ะ,แอร์,ฮ่อง,เฮีย,อีเมล,กดขี่,กดดัน,กติกา,กระจก,กระทง," +
                "กระทบ,กระทะ,กระทำ,กระผม,กระไร,กระแส,กริยา,กรี๊ด,กรุณา,กล้วย,กล่อง,กล้อง,กลั้น,กล่าว,กลิ่น,กลุ่ม,กว้าง," +
                "กอล์ฟ,กังวล,การ์ด,กำกับ,กำจัด,กำนัน,กำแพง,กำลัง,กำหนด,กิเลส,กุญแจ,เกณฑ์,เกร็ง,เกล้า,เกลือ,เกษตร,เกื้อ," +
                "เกือบ,แก้ไข,แกนนำ,แกล้ง,ขนส่ง,ขว้าง,ของดี,ข้อดี,ขอตัว,ขอโทษ,ขอบใจ,ขอรับ,ข้อหา,ขัดใจ,ขันที,ขันธ์,ขับรถ," +
                "เขย่า,เขียน,เขียว,ไขมัน,คงที่,คนขับ,คนขาย,คนไข้,คนงาน,คนใช้,คนตาย,ค้นพบ,คนรัก,คนเรา,ค้นหา,ครรภ์," +
                "ครั้ง,ครั้น,คร่าว,ครึ่ง,คล่อง,คลั่ง,คล้าย,คลื่น,คะแนน,คำตอบ,คำถาม,คำนวณ,คำนึง,คำพูด,เครือ,เคารพ,เคียง," +
                "เคือง,แคว้น,โฆษณา,งดงาม,เงียบ,เงือก,จนถึง,จราจร,จอมพล,จอห์น,จัดทำ,จัดหา,จับใจ,จับตา,จารึก,จำกัด," +
                "จำคุก,จำนวน,จำนอง,จำแนก,จำพวก,จำลอง,จำเลย,จิตใจ,จูงใจ,เจตนา,เจรจา,เจริญ,เจอร์,เจียง,โจทก์,โจทย์," +
                "โจมตี,เฉพาะ,เฉลิม,ชดเชย,ชดใช้,ชอบใจ,ชะงัก,ชะมัด,ชาวนา,ชำนาญ,ชำรุด,ชีวิต,ชุมชน,เชียง,เชียว,เชื่อ,เชื้อ," +
                "เชือก,แชมป์,โชคดี,เซลล์,เซอร์,เซียน,ญัตติ,ดนตรี,ดรุณี,ดวงตา,ดัชนี,ดำน้ำ,ดิฉัน,ดีงาม,ดีเซล,ดุสิต,ดูงาน,ดูถูก," +
                "เดนซ์,เดวิด,เดอร์,เดียว,เดือด,เดือน,ตกต่ำ,ตนเอง,ต่อไป,ต่อมา,ตะกอน,ตะโกน,ตะลึง,ตะวัน,ตัณหา,ตัวดี," +
                "ตาบอด,ตามใจ,ตาราง,ตำนาน,ตำรวจ,ตำรับ,ตำหนิ,ติดใจ,เตอร์,เตี่ย,เตี้ย,เตียง,เตือน,ถูกใจ,เถียง,ทดแทน,ทดลอง," +
                "ทดสอบ,ทบทวน,ทรมาน,ทฤษฎี,ทองคำ,ทักษะ,ทันใด,ทันที,ทัวร์,ทัศนะ,ท่าที,ทายาท,ทำการ,ทำงาน,ทำตัว," +
                "ทำท่า,ทำนอง,ทำนาย,ทำบุญ,ทำลาย,ทำให้,ทำเอา,ทิเบต,ทิพย์,ทุกข์,เทวดา,เทียน,เทียบ,เทียม,ธรรมะ,นักรบ," +
                "นายพล,น้ำใจ,น้ำตา,น้ำยา,นิกาย,นิทาน,นินทา,นิมิต,นิยาม,นิยาย,นิสัย,นิสิต,เนี่ย,เนียน,เนื้อ,แน่ใจ,แนะนำ," +
                "บทบาท,บรรจง,บรรจุ,บรรดา,บรรลุ,บริบท,บอร์ด,บัญชี,บันได,บางที,บารมี,บำนาญ,บำบัด,บำรุง,บุคคล,บุรุษ," +
                "บูรพา,เบอร์,เบี้ย,เบียด,เบื่อ,แบงก์,โบราณ,โบสถ์,ใบไม้,ปกปิด,ปรกติ,ประจำ,ประชด,ประชา,ประตู,ประถม,ประมง," +
                "ประสบ,ปรากฏ,ปรีชา,ปล่อย,ปลื้ม,ปัญญา,ปัญหา,ปากกา,ปีศาจ,เปล่ง,เปล่า,เปียก,โปร่ง,ผลงาน,ผลไม้,เผชิญ,เผื่อ," +
                "ฝรั่ง,ฝีมือ,ฝึกฝน,พยาธิ,พรรษา,พร้อม,พระยา,พลเอก,พะเยา,พัฒนา,พันธ์,พันปี,พัสดุ,พาหนะ,พิกัด,พิการ,พินิจ," +
                "พิมพ์,พิเศษ,พึมพำ,เพดาน,เพราะ,เพลิง,เพลิน,เพอร์,เพิ่ง,เพิ่ม,เพียง,เพียร,เพื่อ,แพทย์,โพธิ์,ไพศาล,ฟอร์ม,ฟังดู," +
                "ฟาร์ม,ฟิล์ม,ไฟฟ้า,ภรรยา,ภริยา,ภักดี,ภาชนะ,ภายใน,ภาวนา,ภิกษุ,ภูเขา,มดลูก,มลพิษ,มวลชน,มเหสี,มะนาว,มังกร," +
                "มัธยม,มาตรา,มารดา,มาลัย,เมตตา,เมล็ด,เมื่อ,เมือง,ไมตรี,ยกมือ,ยักษ์,ยากจน,ยาสูบ,ยินดี,ยุโรป,เยาว์,เยื่อ,เยือน,รบกวน,รอคอย";
            _Thai = new Wordlist(words.Split(','), ' ', "Thai");
        }
    }
}
